# Selected

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **str** |  | [optional]
**type** | **SelectedType** |  | [optional]

## Example

```python
from ideastatica_connection_api.models.selected import Selected

# TODO update the JSON string below
json = "{}"
# create an instance of Selected from a JSON string
selected_instance = Selected.from_json(json)
# print the JSON string representation of the object
print(selected_instance.to_json())

# convert the object into a dict
selected_dict = selected_instance.to_dict()
# create an instance of Selected from a dict
selected_from_dict = Selected.from_dict(selected_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)